Repository: bakberdy/travel_app
Catalog: lib/src/core/language/l10n/app_*.arb
Languages: kk

# appTitle
source: Social Media
kk: Әлеуметтік желі

# errorTitle
source: Error
kk: Қате

# validationErrorTitle
source: Validation Error
kk: Тексеру қатесі

# networkErrorTitle
source: Network Error
kk: Желі қатесі

# serverErrorTitle
source: Server Error
kk: Сервер қатесі

# authErrorTitle
source: Authentication Error
kk: Авторизация қатесі

source: Login
kk: Кіру

source: Register
kk: Тіркелу

source: Logout
kk: Шығу

source: Password
kk: Құпия сөз

source: Confirm Password
kk: Құпия сөзді растаңыз

source: Forgot Password?
kk: Құпия сөзді ұмыттыңыз ба?

source: Remember Me
kk: Мені есте сақта

# dontHaveAccount
source: Don't have an account?
kk: Аккаунтыңыз жоқ па?

# alreadyHaveAccount
source: Already have an account?
kk: Аккаунтыңыз бар ма?

source: Sign Up
kk: Тіркелу

source: Sign In
kk: Кіру

source: Welcome Back!
kk: Қайта келуіңізбен!

source: Create Account
kk: Аккаунт жасау

# pleaseEnterEmail
source: Please enter your email
kk: Email-ді енгізіңіз

# pleaseEnterValidEmail
source: Please enter a valid email address
kk: Дұрыс email мекенжайын енгізіңіз

# pleaseEnterPassword
source: Please enter your password
kk: Құпия сөзді енгізіңіз

# pleaseEnterOldPassword
source: Please enter your old password
kk: Ескі құпия сөзді енгізіңіз

# pleaseEnterNewPassword
source: Please enter your new password
kk: Жаңа құпия сөзді енгізіңіз

# pleaseConfirmPassword
source: Please confirm your password
kk: Құпия сөзді растаңыз

source: Passwords do not match
kk: Құпия сөздер сәйкес келмейді

# passwordTooShort
source: Password must be at least 6 characters
kk: Құпия сөз кемінде 6 таңбадан тұруы керек

source: Continue as Guest
kk: Қонақ ретінде жалғастыру

# loginToContinue
source: Sign in to access your account and explore
kk: Аккаунтқа кіру үшін жүйеге кіріңіз

# registerToContinue
source: Join us today and start your journey
kk: Бізге қосылып, саяхатыңызды бастаңыз

source: OR
kk: НЕМЕСЕ

source: First Name
kk: Аты

source: Last Name
kk: Тегі

# pleaseEnterFirstName
source: Please enter your first name
kk: Атыңызды енгізіңіз

# pleaseEnterLastName
source: Please enter your last name
kk: Тегіңізді енгізіңіз

source: Profile Picture URL
kk: Профиль суретінің URL

source: Optional
kk: Міндетті емес

source: Reset Password
kk: Құпия сөзді қалпына келтіру

# resetPasswordDescription
source: Enter your email to receive a reset code
kk: Қалпына келтіру кодын алу үшін электрондық поштаңызды енгізіңіз

# resetPasswordSubtitle
source: We'll send you a code to reset your password
kk: Біз сізге құпия сөзді қалпына келтіру коды жібереміз

source: Send Reset Code
kk: Код жіберу

source: Reset Code
kk: Қалпына келтіру коды

# pleaseEnterResetCode
source: Please enter the reset code
kk: Қалпына келтіру кодын енгізіңіз

source: Resend Code
kk: Кодты қайта жіберу

# passwordResetEmailSent
source: Password reset email sent. Please check your inbox.
kk: Құпия сөзді қалпына келтіру хаты жіберілді. Поштаңызды тексеріңіз.

source: Old Password
kk: Ескі құпия сөз

source: New Password
kk: Жаңа құпия сөз

# changePasswordDescription
source: Enter your old password and choose a new one
kk: Ескі құпия сөзді енгізіп, жаңасын таңдаңыз

# passwordChanged
source: Password changed successfully
kk: Құпия сөз сәтті өзгертілді

source: Weak
kk: Әлсіз

source: Medium
kk: Орташа

source: Strong
kk: Күшті

# passwordStrengthTip
source: Use 8+ characters with uppercase, numbers, and symbols
kk: 8+ таңба, бас әріптер, сандар және таңбалар қолданыңыз

source: Home
kk: Басты бет

source: Profile
kk: Профиль

source: Settings
kk: Параметрлер

source: Notifications
kk: Хабарландырулар

source: Messages
kk: Хабарламалар

source: Search
kk: Іздеу

source: Post
kk: Пост

source: Posts
kk: Посттар

source: Create Post
kk: Пост жасау

source: Edit Post
kk: Постты өңдеу

source: Delete Post
kk: Постты жою

source: Comment
kk: Пікір

source: Comments
kk: Пікірлер

source: Like
kk: Ұнайды

source: Likes
kk: Лайктар

source: Share
kk: Бөлісу

source: Shares
kk: Бөліскендер

source: Save
kk: Сақтау

source: Saved
kk: Сақталған

source: Follow
kk: Жазылу

source: Following
kk: Жазылымдар

source: Followers
kk: Жазылушылар

source: Unfollow
kk: Жазылудан бас тарту

source: Edit Profile
kk: Профильді өңдеу

source: Change Password
kk: Құпия сөзді өзгерту

source: Change Language
kk: Тілді өзгерту

source: Theme
kk: Тақырып

source: Light Mode
kk: Ашық

source: Dark Mode
kk: Қараңғы

source: System Default
kk: Жүйелік

source: Phone Number
kk: Телефон нөмірі

source: Address
kk: Мекенжай

source: Roles
kk: Рөлдер

# noRoles
source: No roles assigned
kk: Рөлдер тағайындалмаған

source: Profile not loaded
kk: Профиль жүктелмеді

# profileUpdated
source: Profile updated successfully
kk: Профиль сәтті жаңартылды

source: Username
kk: Пайдаланушы аты

source: All Users
kk: Барлық пайдаланушылар

source: No users found
kk: Пайдаланушылар табылмады

source: Close
kk: Жабу

source: Cancel
kk: Болдырмау

source: Confirm
kk: Растау

source: Delete
kk: Жою

source: Edit
kk: Өңдеу

# save_action
source: Save
kk: Сақтау

source: Retry
kk: Қайталау

source: OK
kk: Жарайды

source: Yes
kk: Иә

source: No
kk: Жоқ

source: Loading...
kk: Жүктелуде...

source: Please wait...
kk: Күте тұрыңыз...

source: No data available
kk: Деректер жоқ

source: No results found
kk: Нәтиже табылмады

source: Something went wrong
kk: Бірдеңе дұрыс болмады

# welcomeMessage
source: Welcome, {name}!
kk: Қош келдіңіз, {name}!

# postsCount
source: {count, plural, =0{No posts} =1{1 post} other{{count} posts}}
kk: {count, plural, =0{Посттар жоқ} =1{1 пост} other{{count} пост}}

# followersCount
source: {count, plural, =0{No followers} =1{1 follower} other{{count} followers}}
kk: {count, plural, =0{Жазылушылар жоқ} =1{1 жазылушы} other{{count} жазылушы}}

# failure_1000
source: Server error occurred
kk: Сервер қатесі орын алды

# failure_1001
source: No internet connection. Please check your network settings.
kk: Интернет байланысы жоқ. Желі параметрлерін тексеріңіз.

# failure_1002
source: Request timed out. Please try again.
kk: Сұраныс уақыты өтті. Қайталап көріңіз.

# failure_1003
source: You are not authorized. Please log in again.
kk: Сіз авторизацияланбадыңыз. Қайта кіріңіз.

# failure_1004
source: The requested resource was not found.
kk: Сұралған ресурс табылмады.

# failure_1005
source: You don't have permission to access this resource.
kk: Сізде бұл ресурсқа қол жеткізу құқығы жоқ.

# failure_2000
source: Failed to load cached data.
kk: Кэштелген деректерді жүктеу мүмкін болмады.

# failure_2001
source: Storage operation failed. Please check available space.
kk: Сақтау қатесі. Қолжетімді орынды тексеріңіз.

# failure_3000
source: Please check your input and try again.
kk: Енгізілген деректерді тексеріп, қайталап көріңіз.

# failure_3001
source: Please enter a valid email address.
kk: Дұрыс email мекенжайын енгізіңіз.

# failure_3002
source: Password must be at least {minLength} characters long.
kk: Құпия сөз кемінде {minLength} таңбадан тұруы керек.

# failure_3003
source: Password is too weak. Use a stronger password.
kk: Құпия сөз тым қарапайым. Күрделірек қолданыңыз.

# failure_3004
source: {field} is required.
kk: {field} өрісін толтыру міндетті.

# failure_4000
source: Operation failed due to business rules.
kk: Операция бизнес ережелеріне байланысты орындалмады.

# failure_4001
source: You don't have permission to perform this action.
kk: Сізде бұл әрекетті орындауға құқық жоқ.

# failure_4002
source: This resource is already in use.
kk: Бұл ресурс әлдеқашан пайдаланылуда.

# failure_4003
source: Your account has been disabled. Please contact support.
kk: Сіздің аккаунтыңыз бұғатталған. Қолдау қызметіне хабарласыңыз.

# failure_4004
source: This email address is already registered.
kk: Бұл email әлдеқашан тіркелген.

# failure_5000
source: An unexpected error occurred. Please try again.
kk: Күтпеген қате орын алды. Қайталап көріңіз.

# failure_5001
source: Operation was cancelled.
kk: Операция болдырылмады.

# exampleTitle
source: Example App
kk: Мысал қосымшасы

# welcomeToApp
source: Welcome to our beautiful app!
kk: Біздің керемет қосымшаға қош келдіңіз!

source: Explore Features
kk: Мүмкіндіктерді зерттеу

source: View Details
kk: Мәліметтерді қарау

source: Go to Settings
kk: Баптауларға өту

source: Back to Home
kk: Басты бетке оралу

# detailsTitle
source: Details
kk: Мәліметтер

# detailsDescription
source: This is a details page demonstrating AutoRoute navigation. You can navigate between different screens seamlessly.
kk: Бұл AutoRoute навигациясын көрсететін мәліметтер беті. Сіз әртүрлі экрандар арасында еркін жүре аласыз.

source: Navigation Demo
kk: Навигация демосы

source: AutoRoute Features
kk: AutoRoute мүмкіндіктері

# autoRouteDescription
source: AutoRoute provides type-safe navigation, deep linking support, nested navigation, and much more!
kk: AutoRoute типтік қауіпсіз навигацияны, терең сілтемелерді, ішкі навигацияны және көп нәрсені қамтамасыз етеді!

# typeSafeNavigationTitle
source: Type-safe Navigation
kk: Типке қауіпсіз навигация

# typeSafeNavigationDescription
source: Navigate with compile-time safety and auto-completion
kk: Компайл уақытында типтің қауіпсіздігімен және автотолтырумен навигация

# deepLinkingTitle
source: Deep Linking
kk: Терең сілтемелер

# deepLinkingDescription
source: Support for deep links and navigation parameters
kk: Терең сілтемелер мен навигация параметрлерін қолдау

# settingsTitle
source: Settings
kk: Баптаулар

source: Appearance
kk: Сыртқы түрі

source: Language
kk: Тіл

source: Select Theme
kk: Тақырыпты таңдаңыз

source: Select Language
kk: Тілді таңдаңыз

source: About
kk: Қосымша туралы

source: Version
kk: Нұсқа

# appVersion
source: Version 1.0.0
kk: Нұсқа 1.0.0

# developedBy
source: Developed with ❤️ using Flutter
kk: Flutter арқылы ❤️ жасалды

# featureCard1Title
source: Beautiful Design
kk: Әдемі дизайн

# featureCard1Description
source: Modern Material Design 3 with smooth animations
kk: Тегіс анимациялармен заманауи Material Design 3

# featureCard2Title
source: Multi-language
kk: Көптілдік

# featureCard2Description
source: Support for English, Russian, and Kazakh
kk: Ағылшын, орыс және қазақ тілдерін қолдау

# featureCard3Title
source: Dark Mode
kk: Қараңғы режим

source: Catalog
kk: Каталог

# catalogItems
source: Items
kk: Тауарлар

# catalogBrands
source: Brands
kk: Брендтер

# catalogTypes
source: Types
kk: Түрлер

source: Search items
kk: Тауарларды іздеу

source: Price Range
kk: Баға аралығы

source: In Stock
kk: Қоймада

source: Low Stock
kk: Аз

source: Out of Stock
kk: Қоймада жоқ

source: Item Details
kk: Тауар мәліметтері

source: Featured
kk: Ұсынылған

source: Available Stock
kk: Қолдағы саны

# descriptionLabel
source: Description
kk: Сипаттама

source: Filters
kk: Сүзгілер

# allLabel
source: All
kk: Барлығы

source: Brands
kk: Брендтер

source: Types
kk: Түрлер

source: Clear filters
kk: Сүзгілерді тазалау

source: Reviews
kk: Пікірлер

source: Write Review
kk: Пікір жазу

source: Edit Review
kk: Пікірді өңдеу

source: Delete Review
kk: Пікірді жою

source: Rating
kk: Бағалау

source: Review Title
kk: Пікір тақырыбы

# reviewComment
source: Your Review
kk: Сіздің пікіріңіз

source: Submit Review
kk: Пікірді жіберу

source: Average Rating
kk: Орташа баға

# noReviews
source: No reviews yet
kk: Әзірге пікір жоқ

# beFirstReview
source: Be the first to review!
kk: Алғаш болып пікір қалдырыңыз!

# reviewCreated
source: Review created successfully
kk: Пікір сәтті құрылды

# reviewUpdated
source: Review updated successfully
kk: Пікір сәтті жаңартылды

# reviewDeleted
source: Review deleted successfully
kk: Пікір сәтті жойылды

# ratingRequired
source: Please select a rating
kk: Бағаны таңдаңыз

# titleRequired
source: Title is required
kk: Тақырып қажет

# commentRequired
source: Comment is required
kk: Комментарий қажет

# commentTooShort
source: Comment must be at least 10 characters
kk: Комментарий кемінде 10 таңба болуы керек

source: Shopping Cart
kk: Себет

source: Add to Cart
kk: Себетке қосу

source: Remove from Cart
kk: Себеттен жою

source: Clear Cart
kk: Себетті тазалау

# cartTotal
source: Total
kk: Барлығы

# cartSubtotal
source: Subtotal
kk: Аралық сома

# emptyCart
source: Your cart is empty
kk: Себетіңіз бос

source: Continue Shopping
kk: Сауда жалғастыру

source: Proceed to Checkout
kk: Төлеуге өту

source: Quantity
kk: Саны

source: Update Quantity
kk: Санын жаңарту

source: Item added to cart
kk: Тауар себетке қосылды

source: Item removed from cart
kk: Тауар себеттен жойылды

source: Cart cleared
kk: Себет тазартылды

# confirmClearCart
source: Are you sure you want to clear your cart?
kk: Себетті тазалауды растайсыз ба?

source: Wishlist
kk: Тілектер тізімі

source: Add to Wishlist
kk: Тілектерге қосу

source: Remove from Wishlist
kk: Тілектерден жою

source: Clear Wishlist
kk: Тілектерді тазалау

# emptyWishlist
source: Your wishlist is empty
kk: Тілектер тізімі бос

source: Move to Cart
kk: Себетке көшіру

source: Item added to wishlist
kk: Тауар тілектерге қосылды

source: Item removed from wishlist
kk: Тауар тілектерден жойылды

source: Wishlist cleared
kk: Тілектер тізімі тазартылды

# confirmClearWishlist
source: Are you sure you want to clear your wishlist?
kk: Тілектер тізімін тазалауды растайсыз ба?

# movedToCart
source: Item moved to cart
kk: Тауар себетке көшірілді

source: Cart
kk: Корзина

# homeHeroTitle
source: Fast-forward your run
kk: Жүгірісіңді жеделдет

# homeHeroSubtitle
source: Layered cushioning, bold palettes, and traction built for city pace.
kk: Қабатталған амортизация, батыл түстер және қала қарқынына арналған ілініс.

# homeHeroCta
source: Shop the drop
kk: Жаңа дропты көріңіз

# homeCategoryTitle
source: Shop by category
kk: Санаттар бойынша таңдаңыз

# homeFeaturedTitle
source: Featured drops
kk: Таңдаулы дроптар

# homeDiscoverTitle
source: Discover
kk: Ашыңыз

# homeSeeAll
source: See all
kk: Барлығын көру

# homeMemberCtaTitle
source: Unlock members access
kk: Қатысушыларға қолжетімділік

# homeMemberCtaSubtitle
source: Exclusive colorways, early launches, and rewards built for movers.
kk: Эксклюзивті түстер, ерте релиздер және белсенділерге бонустар.

# homeMemberCtaButton
source: Join membership
kk: Клубқа қосылу

# homeHighlightSustainabilityTitle
source: Sustainable build
kk: Экологиялық материалдар

# homeHighlightSustainabilityBody
source: Recycled uppers and low-impact midsoles.
kk: Қайта өңделген үстіңгі бөлік және төмен әсерлі табан.

# homeHighlightLimitedTitle
source: Limited releases
kk: Шектеулі релиздер

# homeHighlightLimitedBody
source: Small-batch colorways before they vanish.
kk: Шағын партия түстері жоғалып кетпей тұрып.

# homeHighlightNewArrivalsTitle
source: Fresh arrivals
kk: Жаңа келулер

# homeHighlightNewArrivalsBody
source: Weekly drops curated for street and track.
kk: Қала мен трекке арналған апталық дроптар.

# homeHighlightComfortTitle
source: Everyday comfort
kk: Күнделікті жайлылық

# homeHighlightComfortBody
source: Featherweight cushioning for long days.
kk: Ұзақ күндерге арналған жеңіл амортизация.

# categoryRunning
source: Running
kk: Жүгіру

# categoryCasual
source: Casual
kk: Күнделікті

# categoryBasketball
source: Basketball
kk: Баскетбол

# categoryLifestyle
source: Lifestyle
kk: Лайфстайл
